{
  "welcome": "مرحباً",
  "hello": "أهلاً",
  "goodbye": "وداعاً",
  "language": "اللغة",
  "english": "الإنجليزية",
  "arabic": "العربية",
  "switchLanguage": "تغيير اللغة",
  "home": "الرئيسية",
  "about": "حول",
  "contact": "اتصل بنا",
  "login": "تسجيل الدخول",
  "logout": "تسجيل الخروج",
  "register": "التسجيل",
  "email": "البريد الإلكتروني",
  "password": "كلمة المرور",
  "submit": "إرسال",
  "cancel": "إلغاء",
  "save": "حفظ",
  "delete": "حذف",
  "edit": "تعديل",
  "search": "بحث",
  "teachers": "المعلمون",
  "subject": "المادة",
  "grade": "المرحلة",
  "hourlyRate": "جنيه / ساعة",
  "viewMore": "عرض المزيد",
  "bookNow": "احجز الآن",
  "loading": "جاري التحميل...",
  "error": "خطأ",
  "searchPage": {
    "title": "اعثر على معلمك"
  },
  "searchFilters": {
    "searchByName": "البحث بالاسم",
    "teacherNamePlaceholder": "اكتب اسم المعلم...",
    "subject": "المادة",
    "gradeLevel": "المرحلة الدراسية",
    "all": "الكل",
    "search": "بحث"
  },
  "teacherDetails": {
    "firstLessonFree": "الدرس الأول مجاناً",
    "hourlyRate": "السعر بالساعة:",
    "lessonType": "نوع الدرس:",
    "rating": "التقييم:",
    "sessions": "الجلسات:",
    "aboutMe": "عني",
    "defaultOverview": "أنا معلم متحمس مكرس لمساعدة الطلاب على تحقيق إمكاناتهم الكاملة.",
    "reviews": "التقييمات",
    "student": "طالب",
    "noReviews": "لا توجد تقييمات بعد. كن أول من يقيم هذا المعلم!"
  },
  "teacherOverviews": {
    "Gamal Abdelsatar": "جمال عبد الستار معلم رياضيات متخصص في المرحلة الثانوية ومتحمس لمساعدة الطلاب على فهم واستمتاع المادة. لديه خبرة واسعة في شرح المفاهيم الرياضية المعقدة بطريقة واضحة ومثيرة للاهتمام، مما يضمن أن الطلاب من جميع المستويات يمكنهم فهم المادة وتحقيق النجاح الأكاديمي.",
    "Mohamed Ali": "محمد علي معلم لغة إنجليزية متخصص في المرحلة الإعدادية ومتحمس لمساعدة الطلاب على تحسين مهاراتهم اللغوية. يركز على بناء أساس قوي في القواعد والمفردات والتواصل، مع خلق بيئة صفية داعمة ومثيرة للاهتمام تشجع الطلاب على التعبير عن أنفسهم بثقة باللغة الإنجليزية.",
    "Anna Lotfy": "آنا لطفي معلمة لغة إيطالية متحمسة ولديها موهبة في جعل الدروس تفاعلية وممتعة. ملتزمة بمساعدة الطلاب على تطوير مهارات لغوية قوية في التحدث والقراءة والكتابة، مع تعريفهم بالثقافة والتقاليد الإيطالية لتعزيز تجربة التعلم.",
    "Asmaa Gamal": "أسماء جمال معلمة علوم متحمسة في المرحلة الإعدادية وملتزمة بجعل التعلم مثيراً ومتاحاً لطلابها. تستخدم طرق تدريس إبداعية وأمثلة من الحياة الواقعية لمساعدة الطلاب على فهم المفاهيم العلمية وتطوير حب الاكتشاف.",
    "Mohanad Soliman": "مهند سليمان معلم تاريخ ذو خبرة في المرحلتين الإعدادية والثانوية. مكرس لإحياء التاريخ من خلال القصص المثيرة والمناقشات التفاعلية وأنشطة التفكير النقدي. يساعد تدريسه الطلاب على فهم الماضي وربطه بالحاضر وتطوير تقدير أعمق للأحداث التاريخية وتأثيرها على العالم.",
    "Mona Waheed": "منى وحيد معلمة جغرافيا متخصصة في المرحلتين الإعدادية والثانوية. لديها موهبة في جعل الجغرافيا مثيرة للاهتمام من خلال ربط الدروس بأمثلة من العالم الواقعي والأحداث الجارية. أسلوبها في التدريس يشجع الفضول والتفكير النقدي وفهم أعمق لمناظر العالم الطبيعية وثقافاته وبيئاته.",
    "Yasser Yahia": "ياسر يحيى معلم كيمياء ماهر في المرحلة الثانوية ومتحمس لتبسيط المفاهيم العلمية المعقدة. يستخدم شروحات واضحة وتجارب وتطبيقات من الحياة الواقعية لمساعدة الطلاب على فهم الكيمياء وتطوير مهارات حل المشاكل القوية. دروسه تلهم الفضول وتقدير أعمق للمادة.",
    "Marawan Abdekader": "مروان عبد القادر معلم فيزياء متخصص في المرحلة الثانوية ومتفوق في جعل المفاهيم الصعبة واضحة ومثيرة للاهتمام. يستخدم أمثلة عملية وعروض توضيحية وتمارين حل المشاكل لمساعدة الطلاب على فهم مبادئ الفيزياء وتطبيقها في مواقف الحياة الواقعية. نهجه يشجع التفكير التحليلي واهتمام حقيقي بالعلوم.",
    "Abdelrahman Gamal": "عبد الرحمن جمال معلم فرنسية متحمس في المرحلة الثانوية وملتزم بمساعدة الطلاب على إتقان اللغة بثقة. يجمع بين القواعد والمفردات وممارسة المحادثة مع رؤى ثقافية مثيرة للاهتمام، مما يجعل التعلم ممتعاً وفعالاً. أسلوبه في التدريس يشجع المشاركة النشطة والتحسن المستمر.",
    "Yasser Ibrahim": "ياسر إبراهيم معلم أحياء متخصص في المرحلتين الإعدادية والثانوية. لديه موهبة في جعل المادة مثيرة للاهتمام من خلال ربط المفاهيم البيولوجية بالحياة اليومية والعالم الطبيعي. من خلال الشروحات الواضحة والمرئيات والأنشطة التفاعلية، يلهم الطلاب لاستكشاف العلوم بفضول وحماس.",
    "Afnan Elgendy": "أفنان الجندي معلمة لغة إنجليزية متحمسة في المرحلة الإعدادية وتركز على بناء ثقة طلابها في التحدث والقراءة والكتابة. تستخدم أنشطة تفاعلية ومواد مثيرة للاهتمام وشروحات واضحة لجعل تعلم اللغة الإنجليزية ممتعاً وفعالاً. أسلوبها الداعم في التدريس يشجع الطلاب على التعبير عن أنفسهم بحرية.",
    "Ahmed Elnagar": "أحمد النجار معلم علم نفس متخصص في المرحلة الثانوية ومتحمس لمساعدة الطلاب على فهم السلوك البشري والعمليات العقلية. يعرض المفاهيم النفسية بطريقة مثيرة للاهتمام ومرتبطة بالواقع، مما يشجع التفكير النقدي والوعي الذاتي. دروسه تلهم الفضول واهتمام أعمق بالمادة.",
    "Aya Ahmed": "آية أحمد معلمة أحياء متحمسة في المرحلة الإعدادية تجعل العلوم حية من خلال الشروحات المثيرة للاهتمام والأمثلة العملية. تساعد الطلاب على فهم المفاهيم المعقدة من خلال ربطها بالحياة اليومية، مما يغرس الفضول وحب التعلم عن العالم الطبيعي.",
    "Samira Noureldin": "سميرة نور الدين معلمة إيطالية متخصصة في المرحلة الثانوية تجمع بين تعلم اللغة واستكشاف الثقافة. تستخدم أنشطة تفاعلية وممارسة المحادثة ومواد مثيرة للاهتمام لمساعدة الطلاب على بناء مهارات قوية في التحدث والقراءة والكتابة. دروسها تجعل تعلم الإيطالية ممتعاً وفعالاً.",
    "Mostafa Anwar": "مصطفى أنور معلم رياضيات ماهر في المرحلتين الإعدادية والثانوية. مكرس لمساعدة الطلاب على فهم المفاهيم الرياضية بوضوح وثقة. باستخدام الشروحات خطوة بخطوة والأمثلة العملية وتمارين حل المشاكل، يجعل الرياضيات مثيرة للاهتمام ومتاحة للمتعلمين من جميع القدرات.",
    "Hassan Elgammal": "حسن الجمال معلم كيمياء متخصص في المرحلة الثانوية ومتحمس لجعل المفاهيم العلمية المعقدة سهلة الفهم. يستخدم شروحات واضحة وتجارب مثيرة للاهتمام وتطبيقات من الحياة الواقعية لمساعدة الطلاب على التواصل مع المادة وتطوير مهارات حل المشاكل القوية.",
    "Hazem Kassem": "حازم قاسم معلم علوم متحمس في المرحلة الثانوية وملتزم بجعل التعلم مثيرة للاهتمام وذات معنى. يشرح المفاهيم العلمية بوضوح ويستخدم أمثلة من الحياة الواقعية وتجارب ومناقشات لمساعدة الطلاب على فهم وتطبيق معرفتهم. تدريسه يلهم الفضول وحب العلوم.",
    "Ayman Hafez": "أيمن حافظ معلم تاريخ ذو خبرة في المرحلتين الإعدادية والثانوية. يجعل الماضي حياً من خلال سرد القصص المثير والمناقشات التفاعلية والشروحات الواضحة. دروسه تساعد الطلاب على فهم الأحداث التاريخية وأسبابها وتأثيرها على العالم، مما يشجع التفكير النقدي وتقدير أعمق للتاريخ.",
    "Maria Elgendy": "ماريا الجندي معلمة علم نفس متخصصة في المرحلة الثانوية ومتحمسة لمساعدة الطلاب على استكشاف علم العقل والسلوك. تعرض المفاهيم النفسية بطريقة واضحة ومثيرة للاهتمام، مما يشجع التأمل الذاتي والتفكير النقدي والمشاركة النشطة في الفصل. دروسها تلهم الفضول وفهم أعمق للطبيعة البشرية.",
    "Maria Mohamed": "ماريا محمد معلمة متخصصة ومتحمسة لمساعدة الطلاب على تحقيق إمكاناتهم الكاملة. تخلق بيئة تعليمية مثيرة للاهتمام وداعمة تشجع الطلاب على الاستكشاف والاستفسار والنمو أكاديمياً وشخصياً.",
    "Omar El Attar": "عمر العطار معلم جغرافيا متحمس في المرحلة الإعدادية يجعل تعلم العالم مثيراً ومتاحاً. يستخدم الخرائط والمرئيات وأمثلة من الحياة الواقعية لمساعدة الطلاب على فهم المفاهيم الجغرافية وربطها بالحياة اليومية. أسلوبه المثير للاهتمام في التدريس يشجع الفضول والاستكشاف."
  },
  "teacherAvailability": {
    "availableTimes": "الأوقات المتاحة",
    "individualLessons": "الدروس الفردية",
    "groupLessons": "الدروس الجماعية",
    "noAvailableDates": "لا توجد أوقات متاحة",
    "noAvailableGroupDates": "لا توجد أوقات متاحة للدروس الجماعية",
    "dateFormats": {
      "friday": "الجمعة",
      "saturday": "السبت",
      "sunday": "الأحد",
      "monday": "الاثنين",
      "tuesday": "الثلاثاء",
      "wednesday": "الأربعاء",
      "thursday": "الخميس",
      "august": "أغسطس",
      "september": "سبتمبر",
      "october": "أكتوبر",
      "november": "نوفمبر",
      "december": "ديسمبر",
      "january": "يناير",
      "february": "فبراير",
      "march": "مارس",
      "april": "أبريل",
      "may": "مايو",
      "june": "يونيو",
      "july": "يوليو",
      "aug": "أغسطس",
      "sep": "سبتمبر",
      "oct": "أكتوبر",
      "nov": "نوفمبر",
      "dec": "ديسمبر",
      "jan": "يناير",
      "feb": "فبراير",
      "mar": "مارس",
      "apr": "أبريل",
      "jun": "يونيو",
      "jul": "يوليو"
    },
    "timeFormats": {
      "am": "صباحاً",
      "pm": "مساءً"
    },
    "commonDates": {
      "august30": "30 أغسطس",
      "september4": "4 سبتمبر",
      "september5": "5 سبتمبر",
      "september6": "6 سبتمبر"
    },
    "commonTimes": {
      "7pm": "7:00 مساءً",
      "8am": "8:00 صباحاً",
      "10am": "10:00 صباحاً",
      "5pm": "5:00 مساءً",
      "6pm": "6:00 مساءً"
    }
  },
  "subjects": {
    "Biology": "الأحياء",
    "Chemistry": "الكيمياء",
    "Physics": "الفيزياء",
    "Science": "العلوم",
    "Math": "الرياضيات",
    "Maths": "الرياضيات",
    "English": "اللغة الإنجليزية",
    "History": "التاريخ",
    "Geography": "الجغرافيا",
    "French": "الفرنسية",
    "Italy": "الإيطالية",
    "Psychology": "علم النفس",
    "Sychology": "علم النفس"
  },
  "gradeLevels": {
    "Preparatory": "الإعدادية",
    "Secondary": "الثانوية",
    "Preparatory and Secondary": "الإعدادية والثانوية"
  },
  "success": "نجح",
  "warning": "تحذير",
  "info": "معلومات",
    "homePage": {
    "banner": {
      "title": "اعثر على أكثر",
      "courses": "الدورات إثارة",
      "subtitle": "تعلم بذكاء، في أي مكان، مع دروس بقيادة خبراء وعملية. أتقن مهارات جديدة بثقة وافتح فرصاً لمستقبلك.",
      "findTeacher": "اعثر على معلمك",
      "searchPlaceholder": "البحث باسم المعلم",
      "subjects": {
        "psychology": "علم النفس",
        "mathematics": "الرياضيات",
        "math": "الرياضيات",
        "physics": "الفيزياء",
        "chemistry": "الكيمياء",
        "biology": "الأحياء",
        "science": "العلوم",
        "english": "اللغة الإنجليزية",
        "history": "التاريخ",
        "geography": "الجغرافيا",
        "computer science": "علوم الحاسوب",
        "programming": "البرمجة",
        "art": "الفن",
        "music": "الموسيقى",
        "sports": "الرياضة",
        "languages": "اللغات",
        "economics": "الاقتصاد",
        "business": "الأعمال",
        "literature": "الأدب",
        "philosophy": "الفلسفة",
        "italy": "إيطاليا",
        "Sychology": "علم النفس",
        "sychology": "علم النفس",
        "Maths": "الرياضيات",
        "maths": "الرياضيات",
        "geography": "الجغرافيا"
      },
      "chatBubbles": {
        "greatTeacher": "معلم رائع",
        "superClear": "واضح جداً",
        "amazingSession": "جلسة مذهلة"
      },
      "comments": {
        "explainsConceptsClearly": "يشرح المفاهيم بوضوح شديد.",
        "goodTeacherButSessionsCouldBeMoreInteractive": "معلم جيد، لكن الجلسات يمكن أن تكون أكثر تفاعلية.",
        "makesLearningEnglishEasier": "الأستاذ محمد علي يجعل تعلم اللغة الإنجليزية أسهل بكثير. يشرح كل شيء بوضوح ويعطينا أمثلة كثيرة للتدرب عليها. أشعر بثقة أكبر في التحدث والكتابة باللغة الإنجليزية بفضل دروسه.",
        "enjoyClassesPatientFriendly": "أستمتع حقاً بفصول الأستاذ محمد علي. إنه صبور وودود ويشجعنا دائماً على بذل قصارى جهدنا. بفضله، تحسنت درجاتي في اللغة الإنجليزية كثيراً.",
        "makesLearningVeryEnjoyable": "يجعل التعلم ممتعاً جداً.",
        "makesScienceReallyInteresting": "الأستاذة أسماء جمال تجعل العلوم مثيرة للاهتمام حقاً. تشرح المواضيع بطريقة سهلة الفهم وتعطينا دائماً تجارب ممتعة لتجربتها",
        "neverUsedToEnjoyScience": "لم أكن أستمتع بالعلوم من قبل، لكن دروس الأستاذة أسماء غيرت ذلك. إنها لطيفة وصبورة ومستعدة دائماً للإجابة على أسئلتنا.",
        "makesHistoryExciting": "الأستاذ مهند سليمان يجعل التاريخ مثيراً وسهلاً للمتابعة. طريقته في سرد القصص تجعل الفصل بأكمله مهتماً من البداية إلى النهاية.",
        "usedToThinkHistoryBoring": "كنت أعتقد أن التاريخ ممل، لكن دروس الأستاذ مهند غيرت رأيي. يشرح الأحداث بوضوح ويساعدنا على فهم سبب أهميتها اليوم.",
        "makesGeographyFun": "الأستاذة منى وحيد تجعل الجغرافيا ممتعة ومثيرة للاهتمام. تشرح الأشياء دائماً بطريقة سهلة الفهم وتستخدم أمثلة رائعة من الحياة الواقعية",
        "enjoyClassesDifferentCountries": "أستمتع بفصول الأستاذة منى لأنها تجعل تعلم البلدان والثقافات المختلفة مثيراً. إنها تلهمنا لاستكشاف العالم والتعلم أكثر عنه",
        "explainsChemistryEasy": "الأستاذ ياسر يحيى يشرح الكيمياء بطريقة تجعلها سهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على تذكر الدروس بشكل أفضل.",
        "usedToStruggleWithChemistry": "كنت أعاني من الكيمياء، لكن أسلوب الأستاذ ياسر الواضح في التدريس وصبره ساعداني على التحسن كثيراً. الآن أستمتع بالمادة فعلاً.",
        "makesPhysicsEasier": "الأستاذ مروان عبد القادر يجعل الفيزياء أسهل للفهم. أمثلته وشروحاته تساعدني على تذكر الدروس بوضوح.",
        "enjoyPhysicsNow": "أستمتع بالفيزياء الآن لأن الأستاذ مروان يوضح لنا كيف ترتبط بالحياة اليومية. فصوله مثيرة ومحفزة دائماً.",
        "makesLearningFrenchFun": "الأستاذ عبد الرحمن جمال يجعل تعلم الفرنسية ممتعاً وتفاعلياً. طريقته في التدريس تساعدني على التحدث وفهم اللغة بشكل أفضل.",
        "likeClassesExplainsClearly": "أحب فصول الأستاذ عبد الرحمن لأنه يشرح كل شيء بوضوح ويشجعنا دائماً على التدرب. تحسن الفرنسية لدي كثيراً بفضله.",
        "makesBiologyLessonsExciting": "الأستاذ ياسر إبراهيم يجعل دروس الأحياء مثيرة وسهلة الفهم. شروحاته تساعدني على تذكر المواضيع بشكل أفضل.",
        "enjoyClassesRealLifeExamples": "أستمتع بفصول الأستاذ ياسر لأنه يستخدم أمثلة من الحياة الواقعية ويجعل تعلم الطبيعة والجسم البشري مثيراً للاهتمام.",
        "makesEnglishLessonsFun": "الأستاذة أفنان الجندي تجعل دروس اللغة الإنجليزية ممتعة وسهلة المتابعة. تساعدنا دائماً عندما لا نفهم شيئاً.",
        "improvedLotInEnglish": "تحسنت كثيراً في اللغة الإنجليزية بفضل تدريس الأستاذة أفنان. إنها صبورة وطيبة وتشجعنا دائماً على بذل قصارى جهدنا.",
        "explainsPsychologyClear": "الأستاذ أحمد النجار يشرح علم النفس بطريقة واضحة ومثيرة للاهتمام. أمثلته تساعدني على فهم المفاهيم بشكل أفضل.",
        "enjoyClassesThinkDifferently": "أستمتع بفصول الأستاذ أحمد لأنها تجعلني أفكر بطريقة مختلفة حول الناس والسلوك. إنه صبور ويجيب دائماً على أسئلتنا.",
        "makesBiologyFun": "الأستاذة آية أحمد تجعل الأحياء ممتعة وسهلة الفهم. تشرح الأشياء دائماً بطريقة بسيطة تساعدني على تذكر الدروس.",
        "enjoyClassesRealLifeExamplesBiology": "أستمتع بفصول الأستاذة آية لأنها تستخدم أمثلة من الحياة الواقعية وتجعل تعلم النباتات والحيوانات والجسم البشري مثيراً للاهتمام.",
        "makesLearningItalianInteresting": "الأستاذة سميرة نور الدين تجعل تعلم الإيطالية مثيراً للاهتمام وممتعاً. تشجعنا دائماً على التحدث والتدرب في الفصل.",
        "improvedLotInItalian": "تحسنت كثيراً في الإيطالية بفضل شروحات الأستاذة سميرة الواضحة وأسلوبها الودود في التدريس. تجعل كل درس ممتعاً.",
        "explainsMathEasy": "الأستاذ مصطفى أنور يشرح الرياضيات بطريقة سهلة المتابعة. خطواته الواضحة تساعدني على حل المشاكل بثقة.",
        "usedToFindMathDifficult": "كنت أجد الرياضيات صعبة، لكن أسلوب الأستاذ مصطفى في التدريس جعلها أسهل بكثير بالنسبة لي. فصوله منظمة ومثيرة للاهتمام دائماً.",
        "makesChemistryInteresting": "الأستاذ حسن الجمال يجعل الكيمياء مثيرة للاهتمام وسهلة التعلم. تجاربه تساعدني على تذكر الدروس بشكل أفضل.",
        "enjoyClassesExplainsClearlyChemistry": "أستمتع بفصول الأستاذ حسن لأنه يشرح كل شيء بوضوح ومستعد دائماً للإجابة على أسئلتنا.",
        "makesScienceLessonsExciting": "الأستاذ حازم قاسم يجعل دروس العلوم مثيرة وسهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على التعلم بشكل أفضل.",
        "enjoyClassesConnectsRealLife": "أستمتع بفصول الأستاذ حازم لأنه يشرح المواضيع بوضوح ويربطها بالحياة الواقعية، مما يجعل التعلم أكثر إثارة للاهتمام.",
        "makesHistoryInteresting": "الأستاذ أيمن حافظ يجعل التاريخ مثيراً للاهتمام وسهلاً للمتابعة. سرده للقصص يجعلني مهتماً طوال الدرس",
        "usedToFindHistoryBoring": "كنت أجد التاريخ ممل، لكن طريقة الأستاذ أيمن في التدريس جعلتني أستمتع به. يشرح الأحداث بوضوح ويوضح سبب أهميتها اليوم.",
        "makesPsychologyInteresting": "الأستاذة ماريا الجندي تجعل علم النفس مثيراً للاهتمام وسهلاً للفهم. أمثلتها تساعدني على ربط الدروس بالحياة الواقعية",
        "enjoyClassesEncouragesDeepThinking": "أستمتع بفصول الأستاذة ماريا لأنها تشجعنا على التفكير بعمق ومشاركة آرائنا. تجعل تعلم علم النفس ممتعاً ومثيراً للاهتمام.",
        "makesGeographyLessonsFun": "الأستاذ عمر العطار يجعل دروس الجغرافيا ممتعة وسهلة الفهم. أتطلع دائماً إلى فصوله.",
        "enjoyTeachingGreatExamples": "أستمتع بتدريس الأستاذ عمر لأنه يستخدم أمثلة رائعة ويشرح كل شيء بوضوح. أصبحت الجغرافيا واحدة من المواد المفضلة لدي."
      }
    },
    "studentNames": {
      "Omar Khaled": "عمر خالد",
      "Sara Mohamed": "سارة محمد",
      "Samar Khaled": "سمر خالد",
      "Ola Mohamed": "علا محمد",
      "Youssef Adel": "يوسف عادل",
      "Aya Magdy": "آية مجدي",
      "Nada Adel": "ندى عادل",
      "Alaa Kamal": "علاء كمال",
      "Mostafa saber": "مصطفى صابر",
      "Aya Kamal": "آية كمال",
      "Menna Ahmed": "منى أحمد",
      "Ahmed Mohamed": "أحمد محمد",
      "Nelly Mahrous": "نيللي محروس",
      "Faiza Ahmed": "فايزة أحمد",
      "Belal Ahmed": "بلال أحمد",
      "Mohamed Mahmoud": "محمد محمود",
      "Sawsan": "سوسن",
      "Nermin Maher": "نرمين ماهر",
      "Shereen Ahmed": "شيرين أحمد",
      "Fawaz Alaa": "فواز علاء",
      "Malk Adel": "ملك عادل",
      "Reda Kamal": "رضا كمال",
      "Nada Yossry": "ندى يسري",
      "Ahmed Kamal": "أحمد كمال",
      "Sara Ahmed": "سارة أحمد",
      "Kareem": "كريم",
      "Adel": "عادل",
      "Amira": "أميرة",
      "Mourad": "مراد",
      "Omar Magdy": "عمر مجدي",
      "Maram": "مرام",
      "Youssef": "يوسف"
    },
    "studentComments": {
      "Omar Khaled": "يشرح المفاهيم بوضوح شديد.",
      "Sara Mohamed": "معلم جيد، لكن الجلسات يمكن أن تكون أكثر تفاعلية.",
      "Samar Khaled": "السيد محمد علي يجعل تعلم اللغة الإنجليزية أسهل بكثير. يشرح كل شيء بوضوح ويعطينا أمثلة كثيرة للتدرب عليها. أشعر بثقة أكبر في التحدث والكتابة باللغة الإنجليزية بفضل دروسه.",
      "Ola Mohamed": "أستمتع حقاً بفصول السيد محمد علي. إنه صبور وودود ويشجعنا دائماً على بذل قصارى جهدنا. بفضله، تحسنت درجاتي في اللغة الإنجليزية كثيراً.",
      "Youssef Adel": "يجعل التعلم ممتعاً جداً.",
      "Aya Magdy": "معلم جيد، لكن الجلسات يمكن أن تكون أكثر تفاعلية.",
      "Nada Adel": "الأستاذة أسماء جمال تجعل العلوم مثيرة للاهتمام حقاً. تشرح المواضيع بطريقة سهلة الفهم وتعطينا دائماً تجارب ممتعة لتجربتها",
      "Alaa Kamal": "لم أكن أستمتع بالعلوم من قبل، لكن دروس الأستاذة أسماء غيرت ذلك. إنها لطيفة وصبورة ومستعدة دائماً للإجابة على أسئلتنا.",
      "Mostafa saber": "السيد مهند سليمان يجعل التاريخ مثيراً وسهلاً للمتابعة. طريقته في سرد القصص تجعل الفصل بأكمله مهتماً من البداية إلى النهاية.",
      "Aya Kamal": "كنت أعتقد أن التاريخ ممل، لكن دروس السيد مهند غيرت رأيي. يشرح الأحداث بوضوح ويساعدنا على فهم سبب أهميتها اليوم.",
      "Menna Ahmed": "الأستاذة منى وحيد تجعل الجغرافيا ممتعة ومثيرة للاهتمام. تشرح الأشياء دائماً بطريقة سهلة الفهم وتستخدم أمثلة رائعة من الحياة الحقيقية",
      "Ahmed Mohamed": "أستمتع بفصول الأستاذة منى لأنها تجعل تعلم البلدان والثقافات المختلفة مثيراً. إنها تلهمنا لاستكشاف وتعلم المزيد عن العالم",
      "Nelly Mahrous": "السيد ياسر يحيى يشرح الكيمياء بطريقة تجعلها سهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على تذكر الدروس بشكل أفضل.",
      "Faiza Ahmed": "كنت أعاني من الكيمياء، لكن أسلوب السيد ياسر الواضح في التدريس وصبره ساعداني على التحسن كثيراً. الآن أستمتع بالمادة فعلاً.",
      "Belal Ahmed": "السيد مروان عبد القادر يجعل الفيزياء أسهل للفهم. أمثلته وشروحاته تساعدني على تذكر الدروس بوضوح.",
      "Mohamed Mahmoud": "أستمتع بالفيزياء الآن لأن السيد مروان يوضح لنا كيف ترتبط بالحياة اليومية. فصوله مثيرة للاهتمام ومحفزة دائماً.",
      "Sawsan": "السيد ياسر إبراهيم يجعل دروس الأحياء مثيرة وسهلة الفهم. شروحاته تساعدني على تذكر المواضيع بشكل أفضل.",
      "Nermin Maher": "أستمتع بفصول السيد ياسر لأنه يستخدم أمثلة من الحياة الحقيقية ويجعل تعلم الطبيعة والجسم البشري مثيراً للاهتمام جداً.",
      "Shereen Ahmed": "الأستاذة أفنان الجندي تجعل دروس اللغة الإنجليزية ممتعة وسهلة المتابعة. تساعدنا دائماً عندما لا نفهم شيئاً.",
      "Fawaz Alaa": "تحسنت كثيراً في اللغة الإنجليزية بفضل تدريس الأستاذة أفنان. إنها صبورة ولطيفة وتشجعنا دائماً على بذل قصارى جهدنا.",
      "Malk Adel": "السيد أحمد النجار يشرح علم النفس بطريقة واضحة ومثيرة للاهتمام. أمثلته تساعدني على فهم المفاهيم بشكل أفضل.",
      "Reda Kamal": "أستمتع بفصول السيد أحمد لأنها تجعلني أفكر بشكل مختلف في الناس والسلوك. إنه صبور ويجيب دائماً على أسئلتنا.",
      "Nada Yossry": "الأستاذة سميرة نور الدين تجعل تعلم الإيطالية مثيراً للاهتمام وممتعاً. تشجعنا دائماً على التحدث والتدرب في الفصل.",
      "Ahmed Kamal": "تحسنت كثيراً في الإيطالية بفضل شروحات الأستاذة سميرة الواضحة وأسلوبها الودود في التدريس. تجعل كل درس ممتعاً.",
      "Sara Ahmed": "السيد حسن الجمال يجعل الكيمياء مثيرة للاهتمام وسهلة التعلم. تجاربه تساعدني على تذكر الدروس بشكل أفضل.",
      "Kareem": "أستمتع بفصول السيد حسن لأنه يشرح كل شيء بوضوح ومستعد دائماً للإجابة على أسئلتنا.",
      "Adel": "السيد حازم قاسم يجعل دروس العلوم مثيرة وسهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على التعلم بشكل أفضل.",
      "Amira": "أستمتع بفصول السيد حازم لأنه يشرح المواضيع بوضوح ويربطها بالحياة الحقيقية، مما يجعل التعلم أكثر إثارة للاهتمام.",
      "Mourad": "السيد أيمن حافظ يجعل التاريخ مثيراً للاهتمام وسهلاً للمتابعة. سرد القصص يبقيني مهتماً طوال الدرس",
      "Omar Magdy": "كنت أجد التاريخ ممل، لكن طريقة السيد أيمن في التدريس جعلتني أستمتع به. يشرح الأحداث بوضوح ويوضح سبب أهميتها اليوم.",
      "Maram": "السيد عمر العطار يجعل دروس الجغرافيا ممتعة وسهلة الفهم. أتطلع دائماً إلى فصوله.",
      "Youssef": "أستمتع بتدريس السيد عمر لأنه يستخدم أمثلة رائعة ويشرح كل شيء بوضوح. أصبحت الجغرافيا من المواد المفضلة لدي."
    },
    "teacherStudentComments": {
      "Gamal Abdelsatar": {
        "Omar Khaled": "يشرح المفاهيم بوضوح شديد.",
        "Sara Mohamed": "معلم جيد، لكن الجلسات يمكن أن تكون أكثر تفاعلية."
      },
      "Mohamed Ali": {
        "Samar Khaled": "السيد محمد علي يجعل تعلم اللغة الإنجليزية أسهل بكثير. يشرح كل شيء بوضوح ويعطينا أمثلة كثيرة للتدرب عليها. أشعر بثقة أكبر في التحدث والكتابة باللغة الإنجليزية بفضل دروسه.",
        "Ola Mohamed": "أستمتع حقاً بفصول السيد محمد علي. إنه صبور وودود ويشجعنا دائماً على بذل قصارى جهدنا. بفضله، تحسنت درجاتي في اللغة الإنجليزية كثيراً."
      },
      "Anna Lotfy": {
        "Youssef Adel": "يجعل التعلم ممتعاً جداً.",
        "Aya Magdy": "معلم جيد، لكن الجلسات يمكن أن تكون أكثر تفاعلية."
      },
      "Asmaa Gamal": {
        "Nada Adel": "الأستاذة أسماء جمال تجعل العلوم مثيرة للاهتمام حقاً. تشرح المواضيع بطريقة سهلة الفهم وتعطينا دائماً تجارب ممتعة لتجربتها",
        "Alaa Kamal": "لم أكن أستمتع بالعلوم من قبل، لكن دروس الأستاذة أسماء غيرت ذلك. إنها لطيفة وصبورة ومستعدة دائماً للإجابة على أسئلتنا."
      },
      "Mohanad Soliman": {
        "Mostafa saber": "السيد مهند سليمان يجعل التاريخ مثيراً وسهلاً للمتابعة. طريقته في سرد القصص تجعل الفصل بأكمله مهتماً من البداية إلى النهاية.",
        "Aya Kamal": "كنت أعتقد أن التاريخ ممل، لكن دروس السيد مهند غيرت رأيي. يشرح الأحداث بوضوح ويساعدنا على فهم سبب أهميتها اليوم."
      },
      "Mona Waheed": {
        "Menna Ahmed": "الأستاذة منى وحيد تجعل الجغرافيا ممتعة ومثيرة للاهتمام. تشرح الأشياء دائماً بطريقة سهلة الفهم وتستخدم أمثلة رائعة من الحياة الحقيقية",
        "Ahmed Mohamed": "أستمتع بفصول الأستاذة منى لأنها تجعل تعلم البلدان والثقافات المختلفة مثيراً. إنها تلهمنا لاستكشاف وتعلم المزيد عن العالم"
      },
      "Yasser Yahia": {
        "Nelly Mahrous": "السيد ياسر يحيى يشرح الكيمياء بطريقة تجعلها سهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على تذكر الدروس بشكل أفضل.",
        "Faiza Ahmed": "كنت أعاني من الكيمياء، لكن أسلوب السيد ياسر الواضح في التدريس وصبره ساعداني على التحسن كثيراً. الآن أستمتع بالمادة فعلاً."
      },
      "Marawan Abdekader": {
        "Belal Ahmed": "السيد مروان عبد القادر يجعل الفيزياء أسهل للفهم. أمثلته وشروحاته تساعدني على تذكر الدروس بوضوح.",
        "Mohamed Mahmoud": "أستمتع بالفيزياء الآن لأن السيد مروان يوضح لنا كيف ترتبط بالحياة اليومية. فصوله مثيرة للاهتمام ومحفزة دائماً."
      },
      "Abdelrahman Gamal": {
        "Nada Adel": "السيد عبد الرحمن جمال يجعل تعلم الفرنسية ممتعاً وتفاعلياً. طريقته في التدريس تساعدني على التحدث وفهم اللغة بشكل أفضل.",
        "Alaa Kamal": "أحب فصول السيد عبد الرحمن لأنه يشرح كل شيء بوضوح ويشجعنا دائماً على التدرب. تحسنت لغتي الفرنسية كثيراً بفضله."
      },
      "Yasser Ibrahim": {
        "Sawsan": "السيد ياسر إبراهيم يجعل دروس الأحياء مثيرة وسهلة الفهم. شروحاته تساعدني على تذكر المواضيع بشكل أفضل.",
        "Nermin Maher": "أستمتع بفصول السيد ياسر لأنه يستخدم أمثلة من الحياة الحقيقية ويجعل تعلم الطبيعة والجسم البشري مثيراً للاهتمام جداً."
      },
      "Afnan Elgendy": {
        "Shereen Ahmed": "الأستاذة أفنان الجندي تجعل دروس اللغة الإنجليزية ممتعة وسهلة المتابعة. تساعدنا دائماً عندما لا نفهم شيئاً.",
        "Fawaz Alaa": "تحسنت كثيراً في اللغة الإنجليزية بفضل تدريس الأستاذة أفنان. إنها صبورة ولطيفة وتشجعنا دائماً على بذل قصارى جهدنا."
      },
      "Ahmed Elnagar": {
        "Malk Adel": "السيد أحمد النجار يشرح علم النفس بطريقة واضحة ومثيرة للاهتمام. أمثلته تساعدني على فهم المفاهيم بشكل أفضل.",
        "Reda Kamal": "أستمتع بفصول السيد أحمد لأنها تجعلني أفكر بشكل مختلف في الناس والسلوك. إنه صبور ويجيب دائماً على أسئلتنا."
      },
      "Aya Ahmed": {
        "Nada Adel": "الأستاذة آية أحمد تجعل الأحياء ممتعة وسهلة الفهم. تشرح الأشياء دائماً بطريقة بسيطة تساعدني على تذكر الدروس.",
        "Alaa Kamal": "أستمتع بفصول الأستاذة آية لأنها تستخدم أمثلة من الحياة الحقيقية وتجعل تعلم النباتات والحيوانات والجسم البشري مثيراً."
      },
      "Samira Noureldin": {
        "Nada Yossry": "الأستاذة سميرة نور الدين تجعل تعلم الإيطالية مثيراً للاهتمام وممتعاً. تشجعنا دائماً على التحدث والتدرب في الفصل.",
        "Ahmed Kamal": "تحسنت كثيراً في الإيطالية بفضل شروحات الأستاذة سميرة الواضحة وأسلوبها الودود في التدريس. تجعل كل درس ممتعاً."
      },
      "Mostafa Anwar": {
        "Nada Adel": "السيد مصطفى أنور يشرح الرياضيات بطريقة سهلة المتابعة. خطواته الواضحة تساعدني على حل المشاكل بثقة.",
        "Alaa Kamal": "كنت أجد الرياضيات صعبة، لكن أسلوب السيد مصطفى في التدريس جعلها أسهل بكثير بالنسبة لي. فصوله منظمة ومثيرة للاهتمام دائماً."
      },
      "Hassan Elgammal": {
        "Sara Ahmed": "السيد حسن الجمال يجعل الكيمياء مثيرة للاهتمام وسهلة التعلم. تجاربه تساعدني على تذكر الدروس بشكل أفضل.",
        "Kareem": "أستمتع بفصول السيد حسن لأنه يشرح كل شيء بوضوح ومستعد دائماً للإجابة على أسئلتنا."
      },
      "Hazem Kassem": {
        "Adel": "السيد حازم قاسم يجعل دروس العلوم مثيرة وسهلة الفهم. تجاربه ممتعة دائماً وتساعدنا على التعلم بشكل أفضل.",
        "Amira": "أستمتع بفصول السيد حازم لأنه يشرح المواضيع بوضوح ويربطها بالحياة الحقيقية، مما يجعل التعلم أكثر إثارة للاهتمام."
      },
      "Ayman Hafez": {
        "Mourad": "السيد أيمن حافظ يجعل التاريخ مثيراً للاهتمام وسهلاً للمتابعة. سرد القصص يبقيني مهتماً طوال الدرس",
        "Omar Magdy": "كنت أجد التاريخ ممل، لكن طريقة السيد أيمن في التدريس جعلتني أستمتع به. يشرح الأحداث بوضوح ويوضح سبب أهميتها اليوم."
      },
      "Maria Elgendy": {
        "Nada Adel": "الأستاذة ماريا الجندي تجعل علم النفس مثيراً للاهتمام وسهلاً للفهم. أمثلتها تساعدني على ربط الدروس بالحياة الحقيقية",
        "Alaa Kamal": "أستمتع بفصول الأستاذة ماريا لأنها تشجعنا على التفكير بعمق ومشاركة آرائنا. تجعل تعلم علم النفس ممتعاً ومثيراً."
      },
      "Omar El Attar": {
        "Maram": "السيد عمر العطار يجعل دروس الجغرافيا ممتعة وسهلة الفهم. أتطلع دائماً إلى فصوله.",
        "Youssef": "أستمتع بتدريس السيد عمر لأنه يستخدم أمثلة رائعة ويشرح كل شيء بوضوح. أصبحت الجغرافيا من المواد المفضلة لدي."
      }
    },
    "whyChooseUs": {
      "title": "لماذا تختارنا؟",
      "description": "تعلم من أفضل المعلمين المؤهلين في راحتك. احجز دروس خاصة أو جماعية، واستمتع بجداول مرنة، واختبر فصولاً تفاعلية عبر الإنترنت — كل ذلك في منصة واحدة."
    },
    "features": {
      "easyBooking": "حجز الدروس بسهولة",
      "qualifiedTeachers": "معلمون مؤهلون",
      "flexibleScheduling": "جدولة مرنة",
      "affordablePackages": "باقات بأسعار معقولة",
      "interactiveClasses": "فصول تفاعلية عبر الإنترنت",
      "varietySubjects": "تنوع في المواد الدراسية"
    },
    "becomeTutor": {
      "title": "كن معلماً",
      "subtitle": "شارك معرفتك وألهم الجيل القادم",
      "flexibleSchedule": "جدول مرن",
      "flexibleScheduleDesc": "علم متى يناسبك",
      "earnIncome": "اكسب دخلاً إضافياً",
      "earnIncomeDesc": "احصل على أجر مقابل خبرتك",
      "professionalGrowth": "النمو المهني",
      "professionalGrowthDesc": "حسّن مهاراتك التعليمية",
      "easyOnboarding": "الانضمام السهل",
      "easyOnboardingDesc": "ابدأ التدريس بنقرات قليلة",
      "joinUs": "انضم إلينا"
    },
    "recommendedTeachers": {
      "title": "المعلمون الموصى بهم",
      "viewMore": "عرض المزيد",
      "bookNow": "احجز الآن"
    },
                   "teacherNames": {
        "Gamal Abdelsatar": "جمال عبد الستار",
        "Mohamed Ali": "محمد علي",
        "Anna Lotfy": "آنا لطفي",
        "Asmaa Gamal": "أسماء جمال",
        "Mohanad Soliman": "مهند سليمان",
        "Mona Waheed": "منى وحيد",
        "Yasser Yahia": "ياسر يحيى",
        "Marawan Abdekader": "مروان عبد القادر",
        "Abdelrahman Gamal": "عبد الرحمن جمال",
        "Yasser Ibrahim": "ياسر إبراهيم",
        "Afnan Elgendy": "أفنان الجندي",
        "Ahmed Elnagar": "أحمد النجار",
        "Aya Ahmed": "آية أحمد",
        "Samira Noureldin": "سميرة نور الدين",
        "Mostafa Anwar": "مصطفى أنور",
        "Hassan Elgammal": "حسن الجمال",
        "Hazem Kassem": "حازم قاسم",
        "Ayman Hafez": "أيمن حافظ",
        "Maria Elgendy": "ماريا الجندي",
        "Maria Mohamed": "ماريا محمد",
        "Omar El Attar": "عمر العطار"
      },
     "services": {
       "title": "خدماتنا",
       "subtitle": "اكتشف حلول التعلم الشاملة المصممة لتلبية أهدافك التعليمية",
       "privateSessions": {
         "title": "الجلسات الخاصة",
         "description": "تجربة تعلم مخصصة مع معلمين متخصصين يتكيفون مع أسلوب تعلمك ووتيرتك.",
         "features": {
           "privateEnvironment": "بيئة خاصة ومركزة.",
           "directAttention": "اهتمام مباشر ومخصص.",
           "flexibleScheduling": "جدولة مرنة وموقع مرن.",
           "tailoredContent": "محتوى مخصص لاحتياجاتك.",
           "immediateFeedback": "تغذية راجعة فورية من المعلم."
         }
       },
       "groupSessions": {
         "title": "الجلسات الجماعية",
         "description": "تعلم مع زملائك في جلسات جماعية تفاعلية تشجع على التعاون والمناقشة.",
         "features": {
           "socialLearning": "تعلم اجتماعي وتعاوني.",
           "peerInteraction": "تفاعل محفز بين الأقران.",
           "learnFromOthers": "تعلم من أسئلة الطلاب الآخرين.",
           "smallGroups": "مجموعات صغيرة",
           "lowCost": "تكلفة منخفضة، قيمة عالية."
                  }
       }
     },
           "reviews": {
        "title": "آراء الطلاب",
        "subtitle": "ماذا يقول الطلاب عنا؟"
      },
      "footer": {
        "description": "احجز معلمين خبراء في أي مادة، في أي وقت. تتبع التقدم وحقق الأهداف من خلال الدروس المخصصة عبر الإنترنت. الطريقة الذكية للتعلم.",
        "quickLinks": "روابط سريعة",
        "home": "الرئيسية",
        "about": "حول",
        "teachers": "المعلمون",
        "support": "الدعم",
        "login": "تسجيل الدخول",
        "signUp": "التسجيل",
        "contactUs": "اتصل بنا",
        "email": "team.4.iti6@gmail.com",
        "phone": "01000000000",
        "location": "الإسكندرية، مصر",
        "subscribe": "اشترك",
        "subscribeDescription": "اشترك في نشرتنا الإخبارية ولا تفوت فرصة تعلم.",
        "emailPlaceholder": "بريدك الإلكتروني",
        "copyright": "ليرنيفاي © فريق 4 2025 جميع الحقوق محفوظة."
      }
    },
    "teacherPending": {
      "title": "أكمل ملفك الشخصي",
      "profileImageUrl": "رابط صورة الملف الشخصي",
      "profileImagePlaceholder": "https://...",
      "invalidImageUrl": "رابط صورة غير صحيح",
      "subject": "المادة",
      "subjectRequired": "المادة مطلوبة",
      "gradeLevel": "المرحلة الدراسية",
      "gradeLevelRequired": "المرحلة الدراسية مطلوبة",
      "hourlyRate": "السعر بالساعة",
      "hourlyRatePlaceholder": "80 جنيه...",
      "priceRequired": "السعر مطلوب",
      "certificateRequired": "الشهادة مطلوبة",
      "uploadingCertificate": "جاري رفع الشهادة...",
      "certificateUploaded": "تم رفع الشهادة بنجاح!",
      "certificateUploadFailed": "فشل في رفع الشهادة.",
      "pleaseUploadCertificate": "يرجى رفع شهادة.",
      "profileAlreadyApproved": "تمت الموافقة على ملفك الشخصي بالفعل",
      "profileSubmitted": "تم إرسال الملف الشخصي للمراجعة.",
      "failedToSubmitProfile": "فشل في إرسال الملف الشخصي",
      "termsAndConditions": "أوافق على الشروط والأحكام",
      "mustAgreeBeforeSubmitting": "يجب الموافقة قبل الإرسال",
      "submitting": "جاري الإرسال...",
      "submitForReview": "إرسال للمراجعة"
    },
    "terms": {
      "title": "الشروط والأحكام",
      "readTerms": "اقرأ الشروط والأحكام",
      "accurateInformation": "أؤكد أن جميع المعلومات والوثائق التي أقدمها دقيقة وصادقة.",
      "profileReview": "أوافق على أن للمنصة الحق في مراجعة ملفي الشخصي والوثائق قبل الموافقة علي كمعلم.",
      "noInappropriateContent": "أوافق على عدم مشاركة أو رفع أي محتوى غير مناسب أو مسيء أو مضلل.",
      "professionalConduct": "أوافق على التصرف باحترام وأدب عند التفاعل مع الطلاب.",
      "accountSuspension": "أوافق على أن للمنصة الحق في تعليق أو إزالة حسابي إذا انتهكت القواعد أو قدمت معلومات خاطئة.",
      "pricingPolicies": "أفهم أن أسعار الدروس والعمولات وطرق الدفع تخضع لسياسات المنصة.",
      "approvalNotGuaranteed": "أعترف بأن موافقة المنصة علي كمعلم ليست مضمونة وتعتمد على عملية المراجعة."
    },
    "close": "إغلاق",
    "aboutUs": {
      "title": "من نحن",
      "description": "ليرنيفاي هي منصة تعلم عبر الإنترنت تربط الطلاب بمعلمين مؤهلين للحصول على دروس مخصصة. سواء كان ذلك فردياً أو في مجموعات، يمكن للطلاب حجز الجلسات عبر الإنترنت بسهولة وإدارة الجداول والدفع بأمان.",
      "benefits": {
        "easyBooking": {
          "title": "الحجز السهل",
          "desc": "يمكن للطلاب تصفح المعلمين والتحقق من التوفر وحجز الدروس فوراً."
        },
        "seamlessCommunication": {
          "title": "التواصل السلس",
          "desc": "دردشة متكاملة ومكالمات فيديو لجعل التعلم سلساً وتفاعلياً."
        },
        "smartTools": {
          "title": "أدوات ذكية",
          "desc": "يمكن للمعلمين إدارة الجداول وتتبع تقدم الطلاب وتنمية أعمالهم."
        }
      },
      "vision": {
        "title": "رؤيتنا",
        "description": "في ليرنيفاي، نؤمن بأن التعليم يجب أن يكون مرناً وميسور التكلفة ومتاحاً للجميع. مهمتنا هي تمكين الطلاب من تحقيق أهدافهم مع تزويد المعلمين بالأدوات التي يحتاجونها للنجاح في العصر الرقمي.",
        "points": {
          "globalCommunity": "بناء مجتمع تعلم عالمي",
          "diverseResources": "موارد تعلم متنوعة",
          "interactiveEngaging": "تفاعلي ومثير للاهتمام",
          "safeEnvironment": "بيئة آمنة وداعمة"
        }
      }
    },
    "contactUs": {
      "hero": {
        "title": "تواصل معنا",
        "description": "لديك أسئلة؟ نحب أن نسمع منك. أرسل لنا رسالة وسنرد عليك في أقرب وقت ممكن."
      },
      "form": {
        "title": "أرسل لنا رسالة",
        "firstName": "الاسم الأول",
        "lastName": "اسم العائلة",
        "email": "البريد الإلكتروني",
        "subject": "الموضوع",
        "message": "الرسالة",
        "firstNamePlaceholder": "أدخل اسمك الأول",
        "lastNamePlaceholder": "أدخل اسم العائلة",
        "emailPlaceholder": "أدخل عنوان بريدك الإلكتروني",
        "subjectPlaceholder": "اختر موضوعاً",
        "messagePlaceholder": "أخبرنا كيف يمكننا مساعدتك...",
        "submitButton": "إرسال الرسالة"
      },
      "validation": {
        "firstNameRequired": "الاسم الأول مطلوب",
        "lastNameRequired": "اسم العائلة مطلوب",
        "emailRequired": "البريد الإلكتروني مطلوب",
        "invalidEmail": "يرجى إدخال عنوان بريد إلكتروني صحيح",
        "subjectRequired": "يرجى اختيار موضوع",
        "messageRequired": "الرسالة مطلوبة",
        "messageMinLength": "يجب أن تكون الرسالة 10 أحرف على الأقل"
      },
      "subjects": {
        "general": "استفسار عام",
        "support": "الدعم التقني",
        "billing": "سؤال حول الفواتير",
        "partnership": "شراكة",
        "other": "أخرى"
      },
      "toast": {
        "success": "تم إرسال الرسالة بنجاح!",
        "error": "فشل في إرسال الرسالة"
      }
    },
    "payment": {
      "steps": {
        "book": "الحجز",
        "yourDetails": "بياناتك",
        "payment": "الدفع"
      },
      "teacherDetails": "تفاصيل المعلم",
      "sessionPrice": "سعر الجلسة:",
      "private": "فردي",
      "groupSession": "جلسة جماعية",
      "availableDates": "التواريخ المتاحة",
      "availableTimes": "الأوقات المتاحة",
      "selectDate": "اختر تاريخاً",
      "selectTime": "اختر وقتاً",
      "back": "السابق",
      "next": "التالي",
      "finish": "إنهاء",
      "confirm": "تأكيد",
      "confirmBooking": "تأكيد الحجز",
      "bookingFailed": "فشل الحجز",
      "bookingError": "حدث خطأ في حجز موعدك. يرجى المحاولة مرة أخرى.",
      "bookingMessage": "هل أنت متأكد من أنك تريد حجز جلسة {{sessionType}} مع {{teacherName}} في {{date}} في {{time}} مقابل {{price}} جنيه؟",
      "form": {
        "firstName": "الاسم الأول",
        "lastName": "اسم العائلة",
        "email": "البريد الإلكتروني",
        "mobile": "رقم الهاتف",
        "cardNumber": "رقم البطاقة",
        "cvv": "رمز الأمان",
        "expiryDate": "تاريخ الانتهاء",
        "cardHolder": "اسم حامل البطاقة",
        "expiryPlaceholder": "(شهر/سنة)"
      },
      "validation": {
        "firstNameRequired": "يرجى كتابة اسمك الأول",
        "firstNameInvalid": "يرجى إدخال اسم أول صحيح",
        "lastNameRequired": "يرجى كتابة اسم العائلة",
        "lastNameInvalid": "يرجى إدخال اسم عائلة صحيح",
        "emailRequired": "البريد الإلكتروني مطلوب",
        "emailInvalid": "يرجى إدخال عنوان بريد إلكتروني صحيح",
        "mobileRequired": "رقم الهاتف مطلوب",
        "mobileInvalid": "يرجى إدخال رقم هاتف صحيح مكون من 11 رقم",
        "cardNumberRequired": "رقم البطاقة مطلوب",
        "cardNumberInvalid": "يرجى إدخال رقم بطاقة صحيح مكون من 16 رقم",
        "cvvRequired": "رمز الأمان مطلوب",
        "cvvInvalid": "يرجى إدخال رمز أمان صحيح مكون من 3 أرقام",
        "expiryRequired": "تاريخ الانتهاء مطلوب",
        "expiryInvalid": "يرجى إدخال تاريخ انتهاء صحيح (شهر/سنة)",
        "cardHolderRequired": "اسم حامل البطاقة مطلوب",
        "cardHolderInvalid": "يرجى إدخال اسم صحيح",
        "sessionTypeRequired": "نوع الجلسة مطلوب.",
        "dateRequired": "التاريخ مطلوب.",
        "timeRequired": "الوقت مطلوب."
      }
    }
  }

